In [2]:
import pandas as pd
#fetch users data from csv file
users_data=pd.read_csv("users_data.csv",index_col=0)
users_data

,Name,Age,Gender,Marital Status,City,Occupation,Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
3,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
4,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
6,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
7,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
8,John,47,M,Single,Dakar,Product Manager,52568,Watching movies
9,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
10,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
11,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
12,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
13,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
14,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
15,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
16,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
18,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
20,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling

In [16]:
#get strucuture of datasets for 20 users data
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            20 non-null     object
 1   Age             20 non-null     int64
 2   Gender          20 non-null     object
 3   Marital Status  20 non-null     object
 4   City            20 non-null     object
 5   Occupation      20 non-null     object
 6   Salary          20 non-null     int64
 7   Hobby           20 non-null     object
dtypes: int64(2), object(6)
memory usage: 1.4+ KB

In [3]:
#get summary for numerical data columns only
users_data.describe()

             Age         Salary
count  20.000000      20.000000
mean   36.300000  165479.650000
std     7.547045   73761.054544
min    24.000000   52568.000000
25%    29.000000   96931.500000
50%    38.000000  172263.000000
75%    42.250000  232521.500000
max    47.000000  286584.000000

In [14]:
#check for missing values
#use numerical values
users_data.isnull().sum()

Name              0
Age               0
Gender            0
Marital Status    0
City              0
Occupation        0
Salary            0
Hobby             0
dtype: int64

In [15]:
#check missing values
#true or false
users_data.isnull().any()

Name              False
Age               False
Gender            False
Marital Status    False
City              False
Occupation        False
Salary            False
Hobby             False
dtype: bool

In [4]:
#get summary for age column
users_data['Age'].describe()

count    20.000000
mean     36.300000
std       7.547045
min      24.000000
25%      29.000000
50%      38.000000
75%      42.250000
max      47.000000
Name: Age, dtype: float64

In [21]:
users_data['Age'].value_counts()

Age
32    3
42    3
28    2
29    2
45    2
41    1
36    1
47    1
40    1
44    1
25    1
24    1
43    1
Name: count, dtype: int64

In [23]:
users_data['Age'].value_counts()

Age
32    3
42    3
28    2
29    2
45    2
41    1
36    1
47    1
40    1
44    1
25    1
24    1
43    1
Name: count, dtype: int64

In [27]:
#get summary for City column
#occurrence for each city
users_data['City'].value_counts()

City
Dakar          6
Addis Ababa    5
Mogadishu      4
Nairobi        2
Kampala        2
Lagos          1
Name: count, dtype: int64

In [30]:
#calculations on salary column
users_data[['Salary']]

    Salary
1   286584
2    88044
3   101214
4   242300
5   164752
6    98984
7    90774
8    52568
9   170151
10  243664
11  248635
12  183767
13  174375
14  229262
15  186330
16  268610
17   89504
18  214231
19   63986
20  111858

In [5]:
users_data['Salary'].describe()

count        20.000000
mean     165479.650000
std       73761.054544
min       52568.000000
25%       96931.500000
50%      172263.000000
75%      232521.500000
max      286584.000000
Name: Salary, dtype: float64

In [32]:
#select name,age,salary columns
users_data[['Name','Age','Salary']]

        Name  Age  Salary
1       Mary   28  286584
2   Napoleon   41   88044
3       Hill   36  101214
4    Wambley   32  242300
5      Ndege   29  164752
6       Noel   42   98984
7      Peter   28   90774
8       John   47   52568
9   Maryanne   40  170151
10   Hillary   44  243664
11    Marion   32  248635
12    Claire   32  183767
13    Cherry   45  174375
14      Pine   42  229262
15     Stone   25  186330
16  Veronica   29  268610
17    Esther   45   89504
18    Andrew   24  214231
19     James   43   63986
20     Nelly   42  111858

In [33]:
#get maximum value on age column
users_data['Age'].max()

np.int64(47)

In [34]:
#get minimum age
users_data['Age'].min()

np.int64(24)

In [35]:
#overall view on age column
users_data['Age'].describe()
#from analytics above
#we have young people

count    20.000000
mean     36.300000
std       7.547045
min      24.000000
25%      29.000000
50%      38.000000
75%      42.250000
max      47.000000
Name: Age, dtype: float64

In [36]:
#get frequency for each age occurrence
users_data['Age'].value_counts()

Age
32    3
42    3
28    2
29    2
45    2
41    1
36    1
47    1
40    1
44    1
25    1
24    1
43    1
Name: count, dtype: int64

In [11]:
#calculate interquartile range for age
Q1=users_data['Age'].quantile(0.25)
Q3=users_data['Age'].quantile(0.75)
IQR=Q3-Q1
IQR

np.float64(13.25)

In [17]:
#rename salary to monthly_salary
users_data.rename(
    columns={"Salary":"Monthly_Salary"},inplace=True)

In [13]:
#show users data with  salary renamed as monthly_salary
users_data

,Name,Age,Gender,Marital Status,City,Occupation,Monthly_Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
3,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
4,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
6,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
7,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
8,John,47,M,Single,Dakar,Product Manager,52568,Watching movies
9,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
10,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
11,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
12,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
13,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
14,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
15,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
16,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
18,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
20,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling

In [14]:
#rename City to Location using mapper
column_mapper={"City":"Location"}
users_data.rename(
    mapper=column_mapper,
    axis=1,
    inplace=True)

In [16]:
#show users data with  City renamed as  Location 
users_data

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
3,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
4,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
6,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
7,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
8,John,47,M,Single,Dakar,Product Manager,52568,Watching movies
9,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
10,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
11,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
12,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
13,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
14,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
15,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
16,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
18,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
20,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling

In [21]:
#add name_city column
users_data["Name_Location"]=users_data["Name"]+","+users_data["Location"]
#show results with name_city column added
users_data

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby,Name_Location
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling,"Mary,Addis Ababa"
2,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels,"Napoleon,Nairobi"
3,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling,"Hill,Addis Ababa"
4,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming,"Wambley,Kampala"
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels,"Ndege,Addis Ababa"
6,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming,"Noel,Dakar"
7,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling,"Peter,Dakar"
8,John,47,M,Single,Dakar,Product Manager,52568,Watching movies,"John,Dakar"
9,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels,"Maryanne,Dakar"
10,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling,"Hillary,Kampala"
11,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies,"Marion,Lagos"
12,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies,"Claire,Mogadishu"
13,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming,"Cherry,Nairobi"
14,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling,"Pine,Dakar"
15,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies,"Stone,Addis Ababa"
16,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels,"Veronica,Dakar"
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels,"Esther,Addis Ababa"
18,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming,"Andrew,Mogadishu"
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies,"James,Mogadishu"
20,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling,"Nelly,Mogadishu"

In [22]:
#drop name_location column
users_data.drop(columns=["Name_Location"],inplace=True)
#show users data with name_location deleted
users_data

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
3,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
4,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
6,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
7,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
8,John,47,M,Single,Dakar,Product Manager,52568,Watching movies
9,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
10,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
11,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
12,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
13,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
14,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
15,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
16,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
18,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
20,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling

In [44]:
#fetch users from Addis Ababa
users_from_addis_ababa=users_data[users_data['Location']=='Addis Ababa']
#reset index
users_from_addis_ababa=users_from_addis.reset_index(drop=True)
#use 1 as label instead of 0 as default
users_from_addis_ababa.index=range(1,len(users_from_addis)+1)
#show results
users_from_addis_ababa

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
3,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
4,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
5,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels

In [43]:
#fetch users whose salary is greater than 250000
salary_more_than_250000=users_data[users_data['Monthly_Salary']>250000]
#reset index
salary_more_than_250000.reset_index(drop=True)
#use 1 as label
salary_more_than_250000.index=range(1,len(salary_more_than_250000)+1)
#show results
salary_more_than_250000

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels

In [45]:
users_data

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
3,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
4,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
6,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
7,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
8,John,47,M,Single,Dakar,Product Manager,52568,Watching movies
9,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
10,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
11,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
12,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
13,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
14,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
15,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
16,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
18,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
20,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling

In [51]:
#sort by age
#from youngest to eldest
users_data.sort_values(by=["Age"],inplace=True)
#reset index
users_data.index=range(1,len(users_data)+1)
#show results
users_data

,Name,Age,Gender,Marital Status,Location,Occupation,Monthly_Salary,Hobby
1,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
2,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
3,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
4,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
5,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
6,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
7,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
8,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
9,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
10,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
11,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
12,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
13,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
14,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling
15,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
16,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
17,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
18,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
19,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
20,John,47,M,Single,Dakar,Product Manager,52568,Watching movies

In [57]:
#select 1,5,10 row labels and columns labelled Location,Occupation,Monthly_Salary
#iloc selects all including the labels themselves
users_data.loc[[1,5,10,15],["Location","Occupation","Monthly_Salary",]]

       Location       Occupation  Monthly_Salary
1     Mogadishu     Data Analyst          214231
5   Addis Ababa  Product Manager          164752
10  Addis Ababa          Plumber          101214
15        Dakar     Data Analyst           98984

In [67]:
#selects items  using positions
# iloc exludes end position
users_data.iloc[[0,3,6],[0,6]]

      Name  Monthly_Salary
1   Andrew          214231
4    Peter           90774
7  Wambley          242300

In [13]:
#sort data by salary
#sort from highest paid to least paid
users_data.sort_values(by=["Salary"],inplace=True,ascending=False)
#reset index
users_data.index=range(1,len(users_data)+1)
#show results
users_data

,Name,Age,Gender,Marital Status,City,Occupation,Salary,Hobby
1,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
2,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
3,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
4,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
5,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
6,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
7,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
8,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
9,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
10,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
11,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
12,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
13,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling
14,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
15,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
16,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
17,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
18,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
19,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
20,John,47,M,Single,Dakar,Product Manager,52568,Watching movies

In [25]:
#loc selects items using column names
#includes end position
#select first 5 rows from users_data
#select only name and salary columns
users_data.loc[0:5,["Name","Salary"]]

       Name  Salary
1      Mary  286584
2  Veronica  268610
3    Marion  248635
4   Hillary  243664
5   Wambley  242300

In [26]:
#select first 5 rows
#select from name to salary columns range
users_data.loc[0:5,"Name":"Salary"]

       Name  Age Gender Marital Status         City       Occupation  Salary
1      Mary   28      M       Divorced  Addis Ababa  Product Manager  286584
2  Veronica   29      F         Single        Dakar  Product Manager  268610
3    Marion   32      M        Married        Lagos          Teacher  248635
4   Hillary   44      F         Single      Kampala     Data Analyst  243664
5   Wambley   32      M       Divorced      Kampala  Product Manager  242300

In [27]:
#use iloc
#exludes end position
#it uses column positions to select items
#select only first 5 rows
#and only first 5 columns
users_data.iloc[0:5,0:5]

       Name  Age Gender Marital Status         City
1      Mary   28      M       Divorced  Addis Ababa
2  Veronica   29      F         Single        Dakar
3    Marion   32      M        Married        Lagos
4   Hillary   44      F         Single      Kampala
5   Wambley   32      M       Divorced      Kampala